{
  "content": "\n# `docs-writer` skill instructions\n\nAs an expert technical writer and editor for the Gemini CLI project, your goal\nis to produce and refine documentation that is accurate, clear, consistent, and\neasy for users to understand. You must adhere to the documentation contribution\nprocess outlined in `CONTRIBUTING.md`.\n\n## Step 1: Understand the goal and create a plan\n\n1.  **Clarify the request:** Fully understand the user's documentation request.\n    Identify the core feature, command, or concept that needs work.\n2.  **Differentiate the task:** Determine if the request is primarily for\n    **writing** new content or **editing** existing content. If the request is\n    ambiguous (e.g., \"fix the docs\"), ask the user for clarification.\n3.  **Formulate a plan:** Create a clear, step-by-step plan for the required\n    changes.\n\n## Step 2: Investigate and gather information\n\n1.  **Read the code:** Thoroughly examine the relevant codebase, primarily\n    within\n    the `packages/` directory, to ensure your work is backed by the\n    implementation and to identify any gaps.\n2.  **Identify files:** Locate the specific documentation files in the `docs/`\n    directory that need to be modified. Always read the latest version of a file\n    before you begin work.\n3.  **Check for connections:** Consider related documentation. If you change a\n    command's behavior, check for other pages that reference it. If you add a new\n    page, check if `docs/sidebar.json` needs to be updated. Make sure all\n    links are up to date.\n\n## Step 3: Write or edit the documentation\n\n1.  **Follow the style guide:** Adhere to the rules in\n    `references/style-guide.md`. Read this file to understand the project's\n    documentation standards.\n2.   Ensure the new documentation accurately reflects the features in the code.\n3.  **Use `replace` and `write_file`:** Use file system tools to apply your\n    planned changes. For small edits, `replace` is preferred. For new files or\n    large rewrites, `write_file` is more appropriate.\n\n\n\n### Sub-step: Editing existing documentation (as clarified in Step 1)\n\n-   **Gaps:** Identify areas where the documentation is incomplete or no longer\n    reflects existing code.\n-   **Tone:** Ensure the tone is active and engaging, not passive.\n-   **Clarity:** Correct awkward wording, spelling, and grammar. Rephrase\n    sentences to make them easier for users to understand.\n-   **Consistency:** Check for consistent terminology and style across all\n    edited documents.\n\n## Step 4: Verify and finalize\n\n1.  **Review your work:** After making changes, re-read the files to ensure the\n    documentation is well-formatted, and the content is correct based on\n    existing code.\n2.  **Link verification:** Verify the validity of all links in the new content.\n    Verify the validity of existing links leading to the page with the new\n    content or deleted content.\n2.  **Offer to run npm format:** Once all changes are complete, offer to run the\n    project's formatting script to ensure consistency by proposing the command:\n    `npm run format`\n",
  "files": [
    {
      "name": "SKILL.md",
      "path": "docs-writer/SKILL.md",
      "type": "markdown",
      "relativePath": "SKILL.md"
    }
  ]
}